[
    {
        "Название": "ТЕПЛИЦА БОЯРСКАЯ ЛЮКС 2.5М",
        "Форма": "Домиком",
        "Каркас": ["оцинкованная труба 40х20 мм"],
        "Ширина": 2.5,
        "Длина": [4, 6, 8, 10, 12],
        "Поликарбонат": ["Стандарт", "Люкс", "Премиум"],
        "Шаг дуг": [1, 0.65],
        "Цена": {
            "Стандарт_4мм_4": 23990,
            "Стандарт_4мм_6": 30990,
            "Стандарт_4мм_8": 37990,
            "Стандарт_4мм_10": 44990,
            "Стандарт_4мм_12": 51990,
            "Люкс_4мм_4": 26990,
            "Люкс_4мм_6": 34990,
            "Люкс_4мм_8": 42990,
            "Люкс_4мм_10": 50990,
            "Люкс_4мм_12": 58990,
            "Премиум_6мм_4": 30990,
            "Премиум_6мм_6": 39990,
            "Премиум_6мм_8": 48990,
            "Премиум_6мм_10": 57990,
            "Премиум_6мм_12": 66990
        },
        "Город": "Москва"
    },
    {
        "Название": "ТЕПЛИЦА СТРЕЛЕЦКАЯ ЛЮКС 3М",
        "Форма": "Арочная",
        "Каркас": ["оцинкованная труба 40х20 мм", "оцинкованная труба 40х20 мм + 20х20 мм"],
        "Ширина": 3,
        "Длина": [4, 6, 8, 10, 12],
        "Поликарбонат": ["Стандарт", "Люкс", "Премиум"],
        "Шаг дуг": [1, 0.65],
        "Цена": {
            "Стандарт_4мм_4": 20990,
            "Стандарт_4мм_6": 27990,
            "Стандарт_4мм_8": 34990,
            "Стандарт_4мм_10": 41990,
            "Стандарт_4мм_12": 48990,
            "Люкс_4мм_4": 24740,
            "Люкс_4мм_6": 32990,
            "Люкс_4мм_8": 41240,
            "Люкс_4мм_10": 49490,
            "Люкс_4мм_12": 57740,
            "Премиум_6мм_4": 28990,
            "Премиум_6мм_6": 38990,
            "Премиум_6мм_8": 48990,
            "Премиум_6мм_10": 58990,
            "Премиум_6мм_12": 69990
        },
        "Город": "Москва"
    }
    // Добавьте остальные теплицы аналогично
]
